"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например: 
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user_dict() которая с помощью input() просит 
  пользователя ввести вопрос, а затем, если вопрос есть в словаре, 
  программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую
    
"""
import re

dialog = {"как дела": "хорошо!", "что делаешь?": "программирую"}

def ask_user():
    while True:
        answer = input('Задать вопрос: ')
        if answer == 'пока':
            break
        else:
            if answer in dialog:
                print(dialog[answer].capitalize())
            else:
                add_answer = input('Я не знаю ответ.. :( Как мне ответить? ')
                dialog[answer] = add_answer

if __name__ == "__main__":
    ask_user()
